In [3]:
import pandas as pd

In [4]:
billionaires = pd.read_csv ('/Users/AudreyKoussou/Desktop/UCDPA_AudreyKoussou/Billionaires2022.csv')

In [5]:
billionaires

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
0,1,Elon Musk,50.0,219000,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,...,Tesla,True,M,28/06/1971,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000,2022,4,Technology,Amazon,United States,Washington,...,Amazon,True,M,12/01/1964,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA",NaN,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
2,3,Bernard Arnault & family,73.0,158000,2022,4,Fashion & Retail,LVMH,France,NaN,...,LVMH Moët Hennessy Louis Vuitton,False,M,05/03/1949,Chairman and CEO,NaN,NaN,NaN,Bernard Arnault oversees the LVMH empire of so...,"Arnault apparently wooed his wife, Helene Merc..."
3,4,Bill Gates,66.0,129000,2022,4,Technology,Microsoft,United States,Washington,...,Bill & Melinda Gates Foundation,True,M,28/10/1955,Cofounder,4.0,"Seattle-Tacoma-Bellevue, WA",NaN,Bill Gates turned his fortune from software fi...,"When Gates was a kid, he spent so much time re..."
4,5,Warren Buffett,91.0,118000,2022,4,Finance & Investments,Berkshire Hathaway,United States,Nebraska,...,Berkshire Hathaway,True,M,30/08/1930,CEO,5.0,"Omaha, NE",NaN,"Known as the ""Oracle of Omaha,"" Warren Buffett...","Buffett still lives in the same Omaha, Nebrask..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2663,2578,Zhang Yuqiang,66.0,1000,2022,4,Manufacturing,Fiberglass,China,NaN,...,NaN,True,M,01/09/1955,NaN,NaN,NaN,NaN,"Zhang Yuqiang chairs Zhenshi Holding Group, a ...",NaN
2664,2578,Zhou Ruxin,59.0,1000,2022,4,Technology,Navigation,China,NaN,...,NaN,True,M,01/03/1963,NaN,NaN,NaN,NaN,"Zhou Ruxin chairs Beijing BDStar Navigation, a...",NaN
2665,2578,Wen Zhou & family,57.0,1000,2022,4,Manufacturing,chemicals,China,NaN,...,NaN,True,M,06/03/1965,NaN,NaN,NaN,NaN,"Zhou Wen chairs Shanghai Pret Composites, a su...",NaN
2666,2578,Zhou Yifeng & family,43.0,1000,2022,4,Energy,liquefied petroleum gas,China,NaN,...,NaN,True,F,11/07/1978,NaN,NaN,NaN,NaN,Zhou Yifeng chairs Shenzhen-listed Oriental En...,NaN
2667,2578,Zhuang Kuilong & family,59.0,1000,2022,4,Manufacturing,polyester,China,NaN,...,NaN,True,M,15/06/1962,NaN,NaN,NaN,NaN,"Zhuang Kuilong chairs Xinfengming Group, a man...",NaN

Indexing

In [5]:
billionaires.index

RangeIndex(start=0, stop=2668, step=1)

In [75]:
billionaires.set_index('personName').head(2)

,rank,age,finalWorth,year,month,category,source,country,state,city,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
personName,,,,,,,,,,,,,,,,,,,,,
Elon Musk,1,50.0,219000,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,Austin,...,Tesla,True,M,28/06/1971,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
Jeff Bezos,2,58.0,171000,2022,4,Technology,Amazon,United States,Washington,Seattle,...,Amazon,True,M,12/01/1964,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA",NaN,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."

In [76]:
billionaires.describe().applymap(lambda x: f"{x:0.0f}")

       rank   age finalWorth  year month philanthropyScore numberOfSiblings
count  2668  2582       2668  2668  2668               396              127
mean   1303    64       4762  2022     4                 2                3
std     748    13      10540     0     0                 1                2
min       1    19       1000  2022     4                 1                1
25%     665    55       1500  2022     4                 1                2
50%    1292    64       2400  2022     4                 2                2
75%    1929    74       4300  2022     4                 2                3
max    2578   100     219000  2022     4                 5               14

In [77]:
pd.DataFrame({'Type': billionaires.dtypes})

                         Type
rank                    int64
personName             object
age                   float64
finalWorth              int64
year                    int64
month                   int64
category               object
source                 object
country                object
state                  object
city                   object
countryOfCitizenship   object
organization           object
selfMade                 bool
gender                 object
birthDate              object
title                  object
philanthropyScore     float64
residenceMsa           object
numberOfSiblings      float64
bio                    object
about                  object

In [78]:
billionaires.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2668 entries, 0 to 2667
Data columns (total 22 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   rank                  2668 non-null   int64
 1   personName            2668 non-null   object
 2   age                   2582 non-null   float64
 3   finalWorth            2668 non-null   int64
 4   year                  2668 non-null   int64
 5   month                 2668 non-null   int64
 6   category              2668 non-null   object
 7   source                2668 non-null   object
 8   country               2655 non-null   object
 9   state                 748 non-null    object
 10  city                  2624 non-null   object
 11  countryOfCitizenship  2668 non-null   object
 12  organization          352 non-null    object
 13  selfMade              2668 non-null   bool
 14  gender                2652 non-null   object
 15  birthDate             2569 non-null   object
 16  title                 401 non-null    object
 17  philanthropyScore     396 non-null    float64
 18  residenceMsa          639 non-null    object
 19  numberOfSiblings      127 non-null    float64
 20  bio                   2668 non-null   object
 21  about                 1562 non-null   object
dtypes: bool(1), float64(3), int64(4), object(14)
memory usage: 440.4+ KB

In [79]:
billionaires.head(5)

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
0,1,Elon Musk,50.0,219000,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,...,Tesla,True,M,28/06/1971,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000,2022,4,Technology,Amazon,United States,Washington,...,Amazon,True,M,12/01/1964,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA",NaN,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
2,3,Bernard Arnault & family,73.0,158000,2022,4,Fashion & Retail,LVMH,France,NaN,...,LVMH Moët Hennessy Louis Vuitton,False,M,05/03/1949,Chairman and CEO,NaN,NaN,NaN,Bernard Arnault oversees the LVMH empire of so...,"Arnault apparently wooed his wife, Helene Merc..."
3,4,Bill Gates,66.0,129000,2022,4,Technology,Microsoft,United States,Washington,...,Bill & Melinda Gates Foundation,True,M,28/10/1955,Cofounder,4.0,"Seattle-Tacoma-Bellevue, WA",NaN,Bill Gates turned his fortune from software fi...,"When Gates was a kid, he spent so much time re..."
4,5,Warren Buffett,91.0,118000,2022,4,Finance & Investments,Berkshire Hathaway,United States,Nebraska,...,Berkshire Hathaway,True,M,30/08/1930,CEO,5.0,"Omaha, NE",NaN,"Known as the ""Oracle of Omaha,"" Warren Buffett...","Buffett still lives in the same Omaha, Nebrask..."

In [80]:
billionaires.tail(5)

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
2663,2578,Zhang Yuqiang,66.0,1000,2022,4,Manufacturing,Fiberglass,China,NaN,...,NaN,True,M,01/09/1955,NaN,NaN,NaN,NaN,"Zhang Yuqiang chairs Zhenshi Holding Group, a ...",NaN
2664,2578,Zhou Ruxin,59.0,1000,2022,4,Technology,Navigation,China,NaN,...,NaN,True,M,01/03/1963,NaN,NaN,NaN,NaN,"Zhou Ruxin chairs Beijing BDStar Navigation, a...",NaN
2665,2578,Wen Zhou & family,57.0,1000,2022,4,Manufacturing,chemicals,China,NaN,...,NaN,True,M,06/03/1965,NaN,NaN,NaN,NaN,"Zhou Wen chairs Shanghai Pret Composites, a su...",NaN
2666,2578,Zhou Yifeng & family,43.0,1000,2022,4,Energy,liquefied petroleum gas,China,NaN,...,NaN,True,F,11/07/1978,NaN,NaN,NaN,NaN,Zhou Yifeng chairs Shenzhen-listed Oriental En...,NaN
2667,2578,Zhuang Kuilong & family,59.0,1000,2022,4,Manufacturing,polyester,China,NaN,...,NaN,True,M,15/06/1962,NaN,NaN,NaN,NaN,"Zhuang Kuilong chairs Xinfengming Group, a man...",NaN

In [81]:
topbillionaires = billionaires[['rank', 'personName','source','country']].head(5)

In [25]:
topbillionaires

   rank                personName              source        country
0     1                 Elon Musk       Tesla, SpaceX  United States
1     2                Jeff Bezos              Amazon  United States
2     3  Bernard Arnault & family                LVMH         France
3     4                Bill Gates           Microsoft  United States
4     5            Warren Buffett  Berkshire Hathaway  United States

In [82]:
btmbillionaires = billionaires[['rank', 'personName','source','country']].tail(5)

In [28]:
btmbillionaires

      rank               personName                   source country
2663  2578            Zhang Yuqiang               Fiberglass   China
2664  2578               Zhou Ruxin               Navigation   China
2665  2578        Wen Zhou & family                chemicals   China
2666  2578     Zhou Yifeng & family  liquefied petroleum gas   China
2667  2578  Zhuang Kuilong & family                polyester   China

In [83]:
billionaires.iloc[[0,1,2,3,4,5],[1,2,3,6,8,12]]

,personName,age,finalWorth,category,country,organization
0,Elon Musk,50.0,219000,Automotive,United States,Tesla
1,Jeff Bezos,58.0,171000,Technology,United States,Amazon
2,Bernard Arnault & family,73.0,158000,Fashion & Retail,France,LVMH Moët Hennessy Louis Vuitton
3,Bill Gates,66.0,129000,Technology,United States,Bill & Melinda Gates Foundation
4,Warren Buffett,91.0,118000,Finance & Investments,United States,Berkshire Hathaway
5,Larry Page,49.0,111000,Technology,United States,Alphabet

In [85]:
billionaires_labelled = billionaires.set_index('rank')

In [86]:
billionaires_labelled.iloc[['0','1334','2667']]

,personName,age,finalWorth,year,month,category,source,country,state,city,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
rank,,,,,,,,,,,,,,,,,,,,,
1,Elon Musk,50.0,219000,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,Austin,...,Tesla,True,M,28/06/1971,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1292,Hamdi Ulukaya,49.0,2400,2022,4,Food & Beverage,greek yogurt,United States,New York,Norwich,...,Chobani,True,M,26/10/1972,Entrepreneur,NaN,NaN,NaN,"Hamdi Ulukaya, known as the yogurt king, is th...","In January 2018, Ulukaya married Louise Vonger..."
2578,Zhuang Kuilong & family,59.0,1000,2022,4,Manufacturing,polyester,China,NaN,Jiaxing,...,NaN,True,M,15/06/1962,NaN,NaN,NaN,NaN,"Zhuang Kuilong chairs Xinfengming Group, a man...",NaN

In [88]:
billionaires[billionaires['finalWorth']>150000]

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
0,1,Elon Musk,50.0,219000,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,...,Tesla,True,M,28/06/1971,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000,2022,4,Technology,Amazon,United States,Washington,...,Amazon,True,M,12/01/1964,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA",NaN,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
2,3,Bernard Arnault & family,73.0,158000,2022,4,Fashion & Retail,LVMH,France,NaN,...,LVMH Moët Hennessy Louis Vuitton,False,M,05/03/1949,Chairman and CEO,NaN,NaN,NaN,Bernard Arnault oversees the LVMH empire of so...,"Arnault apparently wooed his wife, Helene Merc..."

In [6]:
billionaires[(billionaires['finalWorth']>100000) & (billionaires['country'] == 'United States')]

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
0,1,Elon Musk,50.0,219000,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,...,Tesla,True,M,28/06/1971,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000,2022,4,Technology,Amazon,United States,Washington,...,Amazon,True,M,12/01/1964,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA",NaN,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
3,4,Bill Gates,66.0,129000,2022,4,Technology,Microsoft,United States,Washington,...,Bill & Melinda Gates Foundation,True,M,28/10/1955,Cofounder,4.0,"Seattle-Tacoma-Bellevue, WA",NaN,Bill Gates turned his fortune from software fi...,"When Gates was a kid, he spent so much time re..."
4,5,Warren Buffett,91.0,118000,2022,4,Finance & Investments,Berkshire Hathaway,United States,Nebraska,...,Berkshire Hathaway,True,M,30/08/1930,CEO,5.0,"Omaha, NE",NaN,"Known as the ""Oracle of Omaha,"" Warren Buffett...","Buffett still lives in the same Omaha, Nebrask..."
5,6,Larry Page,49.0,111000,2022,4,Technology,Google,United States,California,...,Alphabet,True,M,26/03/1973,Entrepreneur,1.0,"San Jose, CA",NaN,"Larry Page stepped down as CEO of Alphabet, th...",Page has avoided public appearances since Sund...
6,7,Sergey Brin,48.0,107000,2022,4,Technology,Google,United States,California,...,Alphabet,True,M,21/08/1973,Cofounder and board member,1.0,"San Jose, CA",NaN,Sergey Brin stepped down as president of Alpha...,"The richest immigrant in America, Brin has bee..."
7,8,Larry Ellison,77.0,106000,2022,4,Technology,software,United States,Hawaii,...,Oracle,True,M,17/08/1944,CTO and Founder,1.0,NaN,NaN,"Larry Ellison is chairman, chief technology of...",Ellison never finished college. He started out...

In [8]:
genderbillionaires = pd.crosstab(index=billionaires['gender'], columns = 'count')

In [9]:
genderbillionaires

col_0   count
gender
F         311
M        2341

In [10]:
categorybillionaires = pd.crosstab(billionaires['category'], columns = 'count')

In [11]:
categorybillionaires

col_0                       count
category
Automotive                     70
Construction & Engineering     46
Diversified                   180
Energy                         95
Fashion & Retail              250
Finance & Investments         392
Food & Beverage               203
Gambling & Casinos             23
Healthcare                    217
Logistics                      35
Manufacturing                 337
Media & Entertainment          99
Metals & Mining                68
Real Estate                   193
Service                        53
Sports                         27
Technology                    343
Telecom                        37

Grouping

In [12]:
gr_category = billionaires.groupby(['category','gender']).mean()

In [13]:
gr_category

                                          rank        age   finalWorth  \
category                   gender
Automotive                 F        929.000000  74.000000  8025.000000
                           M       1218.353846  62.936508  8366.153846
Construction & Engineering F       1576.000000  62.166667  3183.333333
                           M       1589.400000  65.692308  2620.000000
Diversified                F       1325.428571  63.222222  5107.142857
                           M       1329.662252  69.482993  5243.708609
Energy                     F        949.666667  59.500000  5911.111111
                           M       1233.593023  67.494118  4001.162791
Fashion & Retail           F       1142.718750  61.593750  7490.625000
                           M       1254.887850  68.282297  6199.065421
Finance & Investments      F       1494.592593  64.041667  3774.074074
                           M       1229.265193  64.522346  4492.817680
Food & Beverage            F       1104.641026  64.621622  4838.461538
                           M       1238.740741  66.312102  4539.814815
Gambling & Casinos         F        788.750000  67.000000  9450.000000
                           M       1136.842105  67.736842  3673.684211
Healthcare                 F       1456.941176  62.300000  2717.647059
                           M       1448.661202  64.195531  3396.174863
Logistics                  F       1195.666667  62.666667  2933.333333
                           M       1220.290323  67.931034  5503.225806
Manufacturing              F       1547.046512  57.368421  2574.418605
                           M       1422.395904  64.229682  3345.733788
Media & Entertainment      F        910.900000  68.111111  3850.000000
                           M       1354.647727  62.337209  5188.636364
Metals & Mining            F        970.222222  61.125000  9944.444444
                           M       1200.949153  59.666667  5105.084746
Real Estate                F       1140.761905  67.421053  4528.571429
                           M       1348.391813  67.678571  3460.233918
Service                    F       1121.875000  64.375000  3725.000000
                           M       1372.666667  68.272727  3517.777778
Sports                     F        731.000000  77.000000  4000.000000
                           M       1228.333333  70.625000  3608.333333
Technology                 F       1247.066667  61.037037  5060.000000
                           M       1291.535256  55.659016  6496.794872
Telecom                    F       2324.000000  53.000000  1200.000000
                           M       1382.611111  64.944444  5719.444444

                                     year  month  selfMade  philanthropyScore  \
category                   gender
Automotive                 F       2022.0    4.0  0.500000           2.000000
                           M       2022.0    4.0  0.600000           1.800000
Construction & Engineering F       2022.0    4.0  0.333333           1.000000
                           M       2022.0    4.0  0.575000           1.000000
Diversified                F       2022.0    4.0  0.142857           2.000000
                           M       2022.0    4.0  0.523179           2.000000
Energy                     F       2022.0    4.0  0.444444           2.000000
                           M       2022.0    4.0  0.779070           2.058824
Fashion & Retail           F       2022.0    4.0  0.312500           1.400000
                           M       2022.0    4.0  0.668224           1.782609
Finance & Investments      F       2022.0    4.0  0.148148           2.000000
                           M       2022.0    4.0  0.809392           2.091837
Food & Beverage            F       2022.0    4.0  0.205128           1.142857
                           M       2022.0    4.0  0.611111           1.360000
Gambling & Casinos         F       2022.0    4.0  0.500000           2.500000
                           M       2022.0    4.0  0.894737           1.000000
Healthcare                 F       2022.0    4.0  0.323529           2.333333
                           M       2022.0    4.0  0.775956           1.750000
Logistics                  F       2022.0    4.0  1.000000           2.000000
                           M       2022.0    4.0  0.677419           1.666667
Manufacturing              F       2022.0    4.0  0.302326           2.000000
                           M       2022.0    4.0  0.788396           1.500000
Media & Entertainment      F       2022.0    4.0  0.200000           1.200000
                           M       2022.0    4.0  0.772727           2.166667
Metals & Mining            F       2022.0    4.0  0.000000                NaN
                           M       2022.0    4.0  0.813559                NaN
Real Estate                F       2022.0    4.0  0.238095           1.000000
                           M       2022.0    4.0  0.789474           1.851852
Service                    F       2022.0    4.0  0.000000           1.500000
                           M       2022.0    4.0  0.666667           1.727273
Sports                     F       2022.0    4.0  0.000000           1.666667
                           M       2022.0    4.0  0.791667           1.692308
Technology                 F       2022.0    4.0  0.633333           2.250000
                           M       2022.0    4.0  0.974359           1.833333
Telecom                    F       2022.0    4.0  1.000000                NaN
                           M       2022.0    4.0  0.888889           2.000000

                                   numberOfSiblings
category                   gender
Automotive                 F                    NaN
                           M               3.500000
Construction & Engineering F                    NaN
                           M                    NaN
Diversified                F               1.800000
                           M               2.272727
Energy                     F               3.000000
                           M              14.000000
Fashion & Retail           F               1.500000
                           M               2.636364
Finance & Investments      F               1.000000
                           M               2.333333
Food & Beverage            F               2.000000
                           M               2.500000
Gambling & Casinos         F               4.000000
                           M               1.000000
Healthcare                 F               2.666667
                           M               3.583333
Logistics                  F                    NaN
                           M                    NaN
Manufacturing              F               3.000000
                           M               2.454545
Media & Entertainment      F               2.000000
                           M               2.750000
Metals & Mining            F               2.750000
                           M               3.000000
Real Estate                F                    NaN
                           M               2.800000
Service                    F                    NaN
                           M               2.000000
Sports                     F                    NaN
                           M               2.000000
Technology                 F               1.000000
                           M               3.333333
Telecom                    F                    NaN
                           M               2.666667

In [14]:
gr_organization = billionaires.groupby(['organization','gender']).mean()

In [15]:
gr_organization

,,rank,age,finalWorth,year,month,selfMade,philanthropyScore,numberOfSiblings
organization,gender,,,,,,,,
ABC Supply,F,183.0,75.0,10700.0,2022.0,4.0,1.0,1.0,NaN
AQR Capital Management,M,1818.0,55.0,1600.0,2022.0,4.0,1.0,2.0,NaN
Admiral Group,M,1929.0,64.0,1500.0,2022.0,4.0,1.0,NaN,NaN
Air Lease,M,709.0,76.0,4100.0,2022.0,4.0,1.0,3.0,NaN
AirBnB,M,182.0,40.0,10750.0,2022.0,4.0,1.0,1.0,NaN
...,...,...,...,...,...,...,...,...,...
Xiaomi,M,163.0,52.0,11700.0,2022.0,4.0,1.0,NaN,NaN
Yahoo!,M,992.5,54.0,3150.0,2022.0,4.0,1.0,2.0,NaN
York Capital Management,M,1579.0,62.0,1900.0,2022.0,4.0,1.0,2.0,NaN
Zynga,M,2076.0,56.0,1400.0,2022.0,4.0,1.0,NaN,NaN
eBay,M,173.0,54.0,11300.0,2022.0,4.0,1.0,3.0,NaN

Missing Values and Dropping values

In [16]:
missing_values = billionaires.isnull().sum()

In [18]:
pd.DataFrame({'Number of NaN' : missing_values })

                      Number of NaN
rank                              0
personName                        0
age                              86
finalWorth                        0
year                              0
month                             0
category                          0
source                            0
country                          13
state                          1920
city                             44
countryOfCitizenship              0
organization                   2316
selfMade                          0
gender                           16
birthDate                        99
title                          2267
philanthropyScore              2272
residenceMsa                   2029
numberOfSiblings               2541
bio                               0
about                          1106

In [19]:
total_rows = billionaires.shape[0]

In [21]:
total_rows

2668

In [20]:
pd.DataFrame({'Percentage': (missing_values / total_rows)*100})

                      Percentage
rank                    0.000000
personName              0.000000
age                     3.223388
finalWorth              0.000000
year                    0.000000
month                   0.000000
category                0.000000
source                  0.000000
country                 0.487256
state                  71.964018
city                    1.649175
countryOfCitizenship    0.000000
organization           86.806597
selfMade                0.000000
gender                  0.599700
birthDate               3.710645
title                  84.970015
philanthropyScore      85.157421
residenceMsa           76.049475
numberOfSiblings       95.239880
bio                     0.000000
about                  41.454273

In [ ]:
billionaires.fillna(method='bfill', axis=1).fillna(0).head()

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
0,1,Elon Musk,50.0,219000,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,...,Tesla,True,M,28/06/1971,CEO,1.0,Elon Musk is working to revolutionize transpor...,Elon Musk is working to revolutionize transpor...,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000,2022,4,Technology,Amazon,United States,Washington,...,Amazon,True,M,12/01/1964,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA",Jeff Bezos founded e-commerce giant Amazon in ...,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
2,3,Bernard Arnault & family,73.0,158000,2022,4,Fashion & Retail,LVMH,France,Paris,...,LVMH Moët Hennessy Louis Vuitton,False,M,05/03/1949,Chairman and CEO,Bernard Arnault oversees the LVMH empire of so...,Bernard Arnault oversees the LVMH empire of so...,Bernard Arnault oversees the LVMH empire of so...,Bernard Arnault oversees the LVMH empire of so...,"Arnault apparently wooed his wife, Helene Merc..."
3,4,Bill Gates,66.0,129000,2022,4,Technology,Microsoft,United States,Washington,...,Bill & Melinda Gates Foundation,True,M,28/10/1955,Cofounder,4.0,"Seattle-Tacoma-Bellevue, WA",Bill Gates turned his fortune from software fi...,Bill Gates turned his fortune from software fi...,"When Gates was a kid, he spent so much time re..."
4,5,Warren Buffett,91.0,118000,2022,4,Finance & Investments,Berkshire Hathaway,United States,Nebraska,...,Berkshire Hathaway,True,M,30/08/1930,CEO,5.0,"Omaha, NE","Known as the ""Oracle of Omaha,"" Warren Buffett...","Known as the ""Oracle of Omaha,"" Warren Buffett...","Buffett still lives in the same Omaha, Nebrask..."

In [23]:
billionaires.fillna(method='ffill', axis=1).fillna(0).head()

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
0,1,Elon Musk,50.0,219000,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,...,Tesla,True,M,28/06/1971,CEO,1.0,1.0,1.0,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000,2022,4,Technology,Amazon,United States,Washington,...,Amazon,True,M,12/01/1964,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA","Seattle-Tacoma-Bellevue, WA",Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
2,3,Bernard Arnault & family,73.0,158000,2022,4,Fashion & Retail,LVMH,France,France,...,LVMH Moët Hennessy Louis Vuitton,False,M,05/03/1949,Chairman and CEO,Chairman and CEO,Chairman and CEO,Chairman and CEO,Bernard Arnault oversees the LVMH empire of so...,"Arnault apparently wooed his wife, Helene Merc..."
3,4,Bill Gates,66.0,129000,2022,4,Technology,Microsoft,United States,Washington,...,Bill & Melinda Gates Foundation,True,M,28/10/1955,Cofounder,4.0,"Seattle-Tacoma-Bellevue, WA","Seattle-Tacoma-Bellevue, WA",Bill Gates turned his fortune from software fi...,"When Gates was a kid, he spent so much time re..."
4,5,Warren Buffett,91.0,118000,2022,4,Finance & Investments,Berkshire Hathaway,United States,Nebraska,...,Berkshire Hathaway,True,M,30/08/1930,CEO,5.0,"Omaha, NE","Omaha, NE","Known as the ""Oracle of Omaha,"" Warren Buffett...","Buffett still lives in the same Omaha, Nebrask..."

In [24]:
billionaires.drop_duplicates(subset=['rank','category'])

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
0,1,Elon Musk,50.0,219000,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,...,Tesla,True,M,28/06/1971,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000,2022,4,Technology,Amazon,United States,Washington,...,Amazon,True,M,12/01/1964,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA",NaN,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
2,3,Bernard Arnault & family,73.0,158000,2022,4,Fashion & Retail,LVMH,France,NaN,...,LVMH Moët Hennessy Louis Vuitton,False,M,05/03/1949,Chairman and CEO,NaN,NaN,NaN,Bernard Arnault oversees the LVMH empire of so...,"Arnault apparently wooed his wife, Helene Merc..."
3,4,Bill Gates,66.0,129000,2022,4,Technology,Microsoft,United States,Washington,...,Bill & Melinda Gates Foundation,True,M,28/10/1955,Cofounder,4.0,"Seattle-Tacoma-Bellevue, WA",NaN,Bill Gates turned his fortune from software fi...,"When Gates was a kid, he spent so much time re..."
4,5,Warren Buffett,91.0,118000,2022,4,Finance & Investments,Berkshire Hathaway,United States,Nebraska,...,Berkshire Hathaway,True,M,30/08/1930,CEO,5.0,"Omaha, NE",NaN,"Known as the ""Oracle of Omaha,"" Warren Buffett...","Buffett still lives in the same Omaha, Nebrask..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2614,2578,Ihor Kolomoyskyy,59.0,1000,2022,4,Diversified,"banking, investments",Ukraine,NaN,...,NaN,True,M,13/02/1963,NaN,NaN,NaN,NaN,With fellow Ukrainian billionaire Henadiy Boho...,Kolomoyskyy holds triple Ukrainian-Israeli-Cyp...
2616,2578,Liang Jiankun & family,60.0,1000,2022,4,Metals & Mining,cobalt mining,China,NaN,...,NaN,True,M,01/07/1961,NaN,NaN,NaN,NaN,"Liang Jiankun chairs Nanjing Hanrui Cobalt, a ...",NaN
2619,2578,Udo Mueller,60.0,1000,2022,4,Media & Entertainment,advertising,Germany,NaN,...,NaN,True,M,01/01/1962,NaN,NaN,NaN,NaN,Udo Mueller is advertising and marketing firm ...,"Heinz Stroeer's son Dirk Stroeer, a member of ..."
2634,2578,Boris Rotenberg,65.0,1000,2022,4,Construction & Engineering,"construction, pipes, chemicals",Russia,NaN,...,NaN,True,M,03/01/1957,NaN,NaN,NaN,NaN,"Boris Rotenberg and his older brother, Arkady,...",Boris is vice president of the Russian Judo Fe...
2643,2578,Dean Solon,57.0,1000,2022,4,Energy,solar systems,United States,Tennessee,...,NaN,True,M,01/01/1965,NaN,NaN,"Nashville, TN",NaN,Dean Solon founded Shoals Technologies in 1996...,Since the 1970s Solon has visited Disney World...